name: Service Principal Sign-In from anomalous locations
description: |
  'This query compares the location details of a Service Principal from today with all the historical location details in the past 180 days 
  to look for anomalous location sign-ins.'
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AADServicePrincipalSignInLogs
tactics:
  - InitialAccess
relevantTechniques:
  - T1087
query: |
let starttime = 180d;
let endtime = 2d;
let countThreshold = 0;
AADServicePrincipalSignInLogs
| where TimeGenerated >= ago(endtime)
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), perSPNAuthCount = count() 
by IPAddress, ServicePrincipalName, locationString = strcat(tostring(parse_json(LocationDetails)["countryOrRegion"]), "/", tostring(parse_json(LocationDetails)["state"]), "/", tostring(parse_json(LocationDetails)["city"]), ";" , tostring(parse_json(LocationDetails)["geoCoordinates"]))
| summarize StartTime = min(StartTimeUtc), EndTime = max(EndTimeUtc), distinctSPNCount = count(), SpnList=makeset(ServicePrincipalName), IPAddress=makeset(IPAddress) by locationString
| join kind= anti (
AADServicePrincipalSignInLogs
| where TimeGenerated >= ago(starttime) and TimeGenerated < ago(endtime)
| project locationString= strcat(tostring(parse_json(LocationDetails)["countryOrRegion"]), "/", tostring(parse_json(LocationDetails)["state"]), "/", tostring(parse_json(LocationDetails)["city"]), ";" , tostring(parse_json(LocationDetails)["geoCoordinates"]))
| summarize priorCount = count() by locationString
 ) 
on locationString
| where distinctSPNCount > countThreshold
| project-reorder StartTime, EndTime, SpnList, locationString, IPAddress, distinctSPNCount

comment: When you don't receive any results. Try to change the let endtime = 2d; to a different value.
