name: Sensitive Mail Permissions added to Service Principal
description: |
  'This query looks for Service Principals that have been granted mail permissions in order to access user's their mailbox or send e-mails on behalf of a user.'
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 7d
queryPeriod: 7d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
relevantTechniques:
  - T1098
tags:
  - 
query: |
let auditLookback = 7d;
AuditLogs
| where TimeGenerated >= ago(auditLookback)
| where OperationName =~ 'Add app role assignment to service principal'
| where Result =~ 'Success'
| extend IniatingUser = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| extend AppName = tostring(TargetResources[0].displayName)
| extend EntityType = tostring(TargetResources[0].type)
| extend GrantedPermission = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[1].newValue)))
| extend Description = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[2].newValue)))
| extend ServicePrincipalName = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[4].newValue)))
| where GrantedPermission has_any ("Mail.Read", "Mail.Send", "Mail.ReadWrite", "full_access_as_app")
| where EntityType == 'ServicePrincipal'
| project TimeGenerated, IniatingUser, ServicePrincipalName, GrantedPermission, Description, AppName, EntityType
| sort by TimeGenerated desc
