name: Risky Azure AD permissions granted to application
description: |
  'This query looks for risky permissions that have been granted to an application that allows to have write access to a tenant.'
reference: |
  - https://itconnect.uw.edu/wares/msinf/aad/apps/risky-aad-app-perms/
severity: High
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 7d
queryPeriod: 7d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
relevantTechniques:
  - T1098
tags:
  -
query: |
let auditLookback = 7d;
let opName = dynamic(["Add delegated permission grant", "Add app role assignment to service principal"]);
  AuditLogs
  | where TimeGenerated >= ago(auditLookback)
  | where Category =~ "ApplicationManagement"
  | where ActivityDisplayName in~ (opName)
  | where Result =~ "success"
  | where tostring(InitiatedBy.user.userPrincipalName) has "@" or tostring(InitiatedBy.app.displayName) has "@"
  | extend props = parse_json(tostring(TargetResources[0].modifiedProperties))
  | mv-expand props
  | extend UserAgent = tostring(AdditionalDetails[0].value)
  | extend InitiatingUser = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
  | extend UserIPAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
  | extend DisplayName = tostring(props.displayName)
  | extend Permissions = tostring(parse_json(tostring(props.newValue)))
  | where Permissions has_any ("Directory.AccessAsUser.All", "Directory.ReadWrite.All", "Group.ReadWrite.All", "Application.ReadWrite.All", "Application.ReadWrite.Own", "Device.ReadWrite.All", "Domain.ReadWrite.All", "Member.Read.Hidden", "Policy.Read.All")
  | extend PermissionsAddedTo = tostring(TargetResources[0].displayName)
  | extend Type = tostring(TargetResources[0].type)
  | project-away props
  | join kind=leftouter(
    AuditLogs
    | where ActivityDisplayName has "Consent to application"
    | extend AppName = tostring(TargetResources[0].displayName)
    | extend AppId = tostring(TargetResources[0].id)
    | project AppName, AppId, CorrelationId) on CorrelationId
  | project-reorder TimeGenerated, OperationName, InitiatingUser, UserIPAddress, UserAgent, PermissionsAddedTo, Permissions, AppName, AppId, CorrelationId
  | extend timestamp = TimeGenerated, AccountCustomEntity = InitiatingUser, IPCustomEntity = UserIPAddress
  | sort by TimeGenerated desc
| extend HostCustomEntity = AppName
| extend URLCustomEntity = Permissions
