name: Sensitive Mail Permissions Added to Application
description: |
  'This query looks for sensitive mail permissions that have been granted to applications, 
  which allows a service principal accessing a user mailbox or send e-mails on behalf of a user'
severity: Medium
requiredDataConnectors:
  - connectorId: AzureActiveDirectory
    dataTypes:
      - AuditLogs
queryFrequency: 7d
queryPeriod: 7d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - Persistence
relevantTechniques:
  - T1098
tags:
  -
query: |
let auditLookback = 7d;
let opName = dynamic(["Add app role assignment to service principal", "Add delegated permission grant"]);
  AuditLogs
  | where TimeGenerated >= ago(auditLookback)
  | where Category =~ "ApplicationManagement"
  | where ActivityDisplayName in~ (opName)
  | where Result =~ "success"
  | where tostring(InitiatedBy.user.userPrincipalName) has "@" or tostring(http://InitiatedBy.app.displayName) has "@"
  | extend props = parse_json(tostring(TargetResources[0].modifiedProperties))
  | mv-expand props
  | extend UserAgent = tostring(AdditionalDetails[0].value)
  | extend InitiatingUser = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
  | extend UserIPAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
  | extend DisplayName = tostring(props.displayName)
  | extend Permissions = tostring(parse_json(tostring(props.newValue)))
  | where Permissions has_any ("http://Mail.Read", "Mail.ReadWrite", "Mail.Send", "full_access_as_app")
  | extend PermissionsAddedTo = tostring(TargetResources[0].displayName)
  | extend Type = tostring(TargetResources[0].type)
  | project-away props
  | join kind=leftouter(
    AuditLogs
    | where ActivityDisplayName has "Consent to application"
    | extend AppName = tostring(TargetResources[0].displayName)
    | extend AppId = tostring(TargetResources[0].id)
    | project AppName, AppId, CorrelationId) on CorrelationId
  | project-reorder TimeGenerated, OperationName, InitiatingUser, UserIPAddress, UserAgent, PermissionsAddedTo, Permissions, AppName, AppId, CorrelationId
  | extend timestamp = TimeGenerated, AccountCustomEntity = InitiatingUser, IPCustomEntity = UserIPAddress
  | sort by TimeGenerated desc
